greatscottgadgets/hackrf/firmware/common/lpc43.h
/*
 * This is just a stub to see if I can get things working.
 *  - mossmann
 */

#ifndef __LPC43_H
#define __LPC43_H

#include <stdint.h>

#define LPC43_REG(a)   (*(volatile uint32_t *)(a))
#define LPC43_REG8(a)  (*(volatile uint8_t *)(a))
#define LPC43_REG16(a) (*(volatile uint16_t *)(a))

#define SCB_VTOR    LPC43_REG(0xE000ED08) /* Vector Table Offset Register */

#define GPIO_DIR0   LPC43_REG(0x400F6000)
#define GPIO_DIR1   LPC43_REG(0x400F6004)
#define GPIO_DIR2   LPC43_REG(0x400F6008)
#define GPIO_DIR3   LPC43_REG(0x400F600C)
#define GPIO_DIR4   LPC43_REG(0x400F6010)
#define GPIO_DIR5   LPC43_REG(0x400F6014)
#define GPIO_DIR6   LPC43_REG(0x400F6018)
#define GPIO_DIR7   LPC43_REG(0x400F601C)

#define GPIO_PIN0   LPC43_REG(0x400F6100)
#define GPIO_PIN1   LPC43_REG(0x400F6104)
#define GPIO_PIN2   LPC43_REG(0x400F6108)
#define GPIO_PIN3   LPC43_REG(0x400F610C)
#define GPIO_PIN4   LPC43_REG(0x400F6110)
#define GPIO_PIN5   LPC43_REG(0x400F6114)
#define GPIO_PIN6   LPC43_REG(0x400F6118)
#define GPIO_PIN7   LPC43_REG(0x400F611C)

#define GPIO_SET0   LPC43_REG(0x400F6200)
#define GPIO_SET1   LPC43_REG(0x400F6204)
#define GPIO_SET2   LPC43_REG(0x400F6208)
#define GPIO_SET3   LPC43_REG(0x400F620C)
#define GPIO_SET4   LPC43_REG(0x400F6210)
#define GPIO_SET5   LPC43_REG(0x400F6214)
#define GPIO_SET6   LPC43_REG(0x400F6218)
#define GPIO_SET7   LPC43_REG(0x400F621C)

#define GPIO_CLR0   LPC43_REG(0x400F6280)
#define GPIO_CLR1   LPC43_REG(0x400F6284)
#define GPIO_CLR2   LPC43_REG(0x400F6288)
#define GPIO_CLR3   LPC43_REG(0x400F628C)
#define GPIO_CLR4   LPC43_REG(0x400F6290)
#define GPIO_CLR5   LPC43_REG(0x400F6294)
#define GPIO_CLR6   LPC43_REG(0x400F6298)
#define GPIO_CLR7   LPC43_REG(0x400F629C)

#endif /* __LPC43_H */
